MikroElektronika/core_packages/PIC/XC8/def/PIC18F2431/mcu.h
// Register: SEVTCMPH
#define SEVTCMPH SEVTCMPH
extern volatile unsigned char           SEVTCMPH            __at(0xF70);
#ifndef _LIB_BUILD
asm("SEVTCMPH equ 0F70h");
#endif

// Register: SEVTCMPL
#define SEVTCMPL SEVTCMPL
extern volatile unsigned char           SEVTCMPL            __at(0xF71);
#ifndef _LIB_BUILD
asm("SEVTCMPL equ 0F71h");
#endif

// Register: PDC2H
#define PDC2H PDC2H
extern volatile unsigned char           PDC2H               __at(0xF74);
#ifndef _LIB_BUILD
asm("PDC2H equ 0F74h");
#endif

// Register: PDC2L
#define PDC2L PDC2L
extern volatile unsigned char           PDC2L               __at(0xF75);
#ifndef _LIB_BUILD
asm("PDC2L equ 0F75h");
#endif

// Register: PDC1H
#define PDC1H PDC1H
extern volatile unsigned char           PDC1H               __at(0xF76);
#ifndef _LIB_BUILD
asm("PDC1H equ 0F76h");
#endif

// Register: PDC1L
#define PDC1L PDC1L
extern volatile unsigned char           PDC1L               __at(0xF77);
#ifndef _LIB_BUILD
asm("PDC1L equ 0F77h");
#endif

// Register: PDC0H
#define PDC0H PDC0H
extern volatile unsigned char           PDC0H               __at(0xF78);
#ifndef _LIB_BUILD
asm("PDC0H equ 0F78h");
#endif

// Register: PDC0L
#define PDC0L PDC0L
extern volatile unsigned char           PDC0L               __at(0xF79);
#ifndef _LIB_BUILD
asm("PDC0L equ 0F79h");
#endif

// Register: PTPERH
#define PTPERH PTPERH
extern volatile unsigned char           PTPERH              __at(0xF7A);
#ifndef _LIB_BUILD
asm("PTPERH equ 0F7Ah");
#endif

// Register: PTPERL
#define PTPERL PTPERL
extern volatile unsigned char           PTPERL              __at(0xF7B);
#ifndef _LIB_BUILD
asm("PTPERL equ 0F7Bh");
#endif

// Register: PTMRH
#define PTMRH PTMRH
extern volatile unsigned char           PTMRH               __at(0xF7C);
#ifndef _LIB_BUILD
asm("PTMRH equ 0F7Ch");
#endif

// Register: PTMRL
#define PTMRL PTMRL
extern volatile unsigned char           PTMRL               __at(0xF7D);
#ifndef _LIB_BUILD
asm("PTMRL equ 0F7Dh");
#endif

// Register: PTCON1
#define PTCON1 PTCON1
extern volatile unsigned char           PTCON1              __at(0xF7E);
#ifndef _LIB_BUILD
asm("PTCON1 equ 0F7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned PTDIR                  :1;
        unsigned PTEN                   :1;
    };
} PTCON1bits_t;
extern volatile PTCON1bits_t PTCON1bits __at(0xF7E);
// bitfield macros
#define _PTCON1_PTDIR_POSN                                  0x6
#define _PTCON1_PTDIR_POSITION                              0x6
#define _PTCON1_PTDIR_SIZE                                  0x1
#define _PTCON1_PTDIR_LENGTH                                0x1
#define _PTCON1_PTDIR_MASK                                  0x40
#define _PTCON1_PTEN_POSN                                   0x7
#define _PTCON1_PTEN_POSITION                               0x7
#define _PTCON1_PTEN_SIZE                                   0x1
#define _PTCON1_PTEN_LENGTH                                 0x1
#define _PTCON1_PTEN_MASK                                   0x80

// Register: PTCON0
#define PTCON0 PTCON0
extern volatile unsigned char           PTCON0              __at(0xF7F);
#ifndef _LIB_BUILD
asm("PTCON0 equ 0F7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTMOD                  :2;
        unsigned PTCKPS                 :2;
        unsigned PTOPS                  :4;
    };
    struct {
        unsigned PTMOD0                 :1;
        unsigned PTMOD1                 :1;
        unsigned PTCKPS0                :1;
        unsigned PTCKPS1                :1;
        unsigned PTOPS0                 :1;
        unsigned PTOPS1                 :1;
        unsigned PTOPS2                 :1;
        unsigned PTOPS3                 :1;
    };
} PTCON0bits_t;
extern volatile PTCON0bits_t PTCON0bits __at(0xF7F);
// bitfield macros
#define _PTCON0_PTMOD_POSN                                  0x0
#define _PTCON0_PTMOD_POSITION                              0x0
#define _PTCON0_PTMOD_SIZE                                  0x2
#define _PTCON0_PTMOD_LENGTH                                0x2
#define _PTCON0_PTMOD_MASK                                  0x3
#define _PTCON0_PTCKPS_POSN                                 0x2
#define _PTCON0_PTCKPS_POSITION                             0x2
#define _PTCON0_PTCKPS_SIZE                                 0x2
#define _PTCON0_PTCKPS_LENGTH                               0x2
#define _PTCON0_PTCKPS_MASK                                 0xC
#define _PTCON0_PTOPS_POSN                                  0x4
#define _PTCON0_PTOPS_POSITION                              0x4
#define _PTCON0_PTOPS_SIZE                                  0x4
#define _PTCON0_PTOPS_LENGTH                                0x4
#define _PTCON0_PTOPS_MASK                                  0xF0
#define _PTCON0_PTMOD0_POSN                                 0x0
#define _PTCON0_PTMOD0_POSITION                             0x0
#define _PTCON0_PTMOD0_SIZE                                 0x1
#define _PTCON0_PTMOD0_LENGTH                               0x1
#define _PTCON0_PTMOD0_MASK                                 0x1
#define _PTCON0_PTMOD1_POSN                                 0x1
#define _PTCON0_PTMOD1_POSITION                             0x1
#define _PTCON0_PTMOD1_SIZE                                 0x1
#define _PTCON0_PTMOD1_LENGTH                               0x1
#define _PTCON0_PTMOD1_MASK                                 0x2
#define _PTCON0_PTCKPS0_POSN                                0x2
#define _PTCON0_PTCKPS0_POSITION                            0x2
#define _PTCON0_PTCKPS0_SIZE                                0x1
#define _PTCON0_PTCKPS0_LENGTH                              0x1
#define _PTCON0_PTCKPS0_MASK                                0x4
#define _PTCON0_PTCKPS1_POSN                                0x3
#define _PTCON0_PTCKPS1_POSITION                            0x3
#define _PTCON0_PTCKPS1_SIZE                                0x1
#define _PTCON0_PTCKPS1_LENGTH                              0x1
#define _PTCON0_PTCKPS1_MASK                                0x8
#define _PTCON0_PTOPS0_POSN                                 0x4
#define _PTCON0_PTOPS0_POSITION                             0x4
#define _PTCON0_PTOPS0_SIZE                                 0x1
#define _PTCON0_PTOPS0_LENGTH                               0x1
#define _PTCON0_PTOPS0_MASK                                 0x10
#define _PTCON0_PTOPS1_POSN                                 0x5
#define _PTCON0_PTOPS1_POSITION                             0x5
#define _PTCON0_PTOPS1_SIZE                                 0x1
#define _PTCON0_PTOPS1_LENGTH                               0x1
#define _PTCON0_PTOPS1_MASK                                 0x20
#define _PTCON0_PTOPS2_POSN                                 0x6
#define _PTCON0_PTOPS2_POSITION                             0x6
#define _PTCON0_PTOPS2_SIZE                                 0x1
#define _PTCON0_PTOPS2_LENGTH                               0x1
#define _PTCON0_PTOPS2_MASK                                 0x40
#define _PTCON0_PTOPS3_POSN                                 0x7
#define _PTCON0_PTOPS3_POSITION                             0x7
#define _PTCON0_PTOPS3_SIZE                                 0x1
#define _PTCON0_PTOPS3_LENGTH                               0x1
#define _PTCON0_PTOPS3_MASK                                 0x80

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0xF80);
#ifndef _LIB_BUILD
asm("PORTA equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned                        :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned AN2                    :1;
        unsigned AN3                    :1;
        unsigned AN4                    :1;
        unsigned                        :1;
        unsigned OSC2                   :1;
        unsigned OSC1                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned VREFM                  :1;
        unsigned VREFP                  :1;
        unsigned                        :2;
        unsigned CLKO                   :1;
        unsigned CLKI                   :1;
    };
    struct {
        unsigned ULPWUIN                :1;
        unsigned                        :6;
        unsigned RJPU                   :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x3
#define _PORTA_AN3_POSITION                                 0x3
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x8
#define _PORTA_AN4_POSN                                     0x4
#define _PORTA_AN4_POSITION                                 0x4
#define _PORTA_AN4_SIZE                                     0x1
#define _PORTA_AN4_LENGTH                                   0x1
#define _PORTA_AN4_MASK                                     0x10
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_OSC1_POSN                                    0x7
#define _PORTA_OSC1_POSITION                                0x7
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x80
#define _PORTA_VREFM_POSN                                   0x2
#define _PORTA_VREFM_POSITION                               0x2
#define _PORTA_VREFM_SIZE                                   0x1
#define _PORTA_VREFM_LENGTH                                 0x1
#define _PORTA_VREFM_MASK                                   0x4
#define _PORTA_VREFP_POSN                                   0x3
#define _PORTA_VREFP_POSITION                               0x3
#define _PORTA_VREFP_SIZE                                   0x1
#define _PORTA_VREFP_LENGTH                                 0x1
#define _PORTA_VREFP_MASK                                   0x8
#define _PORTA_CLKO_POSN                                    0x6
#define _PORTA_CLKO_POSITION                                0x6
#define _PORTA_CLKO_SIZE                                    0x1
#define _PORTA_CLKO_LENGTH                                  0x1
#define _PORTA_CLKO_MASK                                    0x40
#define _PORTA_CLKI_POSN                                    0x7
#define _PORTA_CLKI_POSITION                                0x7
#define _PORTA_CLKI_SIZE                                    0x1
#define _PORTA_CLKI_LENGTH                                  0x1
#define _PORTA_CLKI_MASK                                    0x80
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1
#define _PORTA_RJPU_POSN                                    0x7
#define _PORTA_RJPU_POSITION                                0x7
#define _PORTA_RJPU_SIZE                                    0x1
#define _PORTA_RJPU_LENGTH                                  0x1
#define _PORTA_RJPU_MASK                                    0x80

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_CCP2_PA2_POSN                                0x3
#define _PORTB_CCP2_PA2_POSITION                            0x3
#define _PORTB_CCP2_PA2_SIZE                                0x1
#define _PORTB_CCP2_PA2_LENGTH                              0x1
#define _PORTB_CCP2_PA2_MASK                                0x8

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0xF82);
#ifndef _LIB_BUILD
asm("PORTC equ 0F82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
        unsigned CCP1                   :1;
        unsigned INT0                   :1;
        unsigned INT1                   :1;
        unsigned INT2                   :1;
        unsigned TX                     :1;
        unsigned RX                     :1;
    };
    struct {
        unsigned T13CKI                 :1;
        unsigned CCP2                   :1;
        unsigned                        :1;
        unsigned T0CKI                  :1;
        unsigned SDA                    :1;
        unsigned SCK                    :1;
        unsigned CK                     :1;
        unsigned DT                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_FLTA               :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_FLTB               :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_SS                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned nFLTA                  :1;
        unsigned nFLTB                  :1;
        unsigned T5CKI                  :1;
        unsigned SDI                    :1;
        unsigned SCL                    :1;
        unsigned nSS                    :1;
        unsigned SDO                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned FLTA                   :1;
        unsigned FLTB                   :1;
        unsigned                        :3;
        unsigned SS                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned _PA2                    :1;  // Note: Changed by MikroE
        unsigned _PA1                    :1;  // Note: Changed by MikroE
    };
} PORTCbits_t;
